---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalLink.OwnerId
source: html/74dc90bb-9ef9-eacd-5589-c9adf5e3ad54.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLink.OwnerId Property

ElementId of Analytical Element which created the AnalyticalLink (if any)
 invalidElementId if this Analytical Link was created by the User or API

## Syntax (C#)
```csharp
public ElementId OwnerId { get; }
```